// 초기값 설정 (1) 강화 단계별 검의 정보를 담은 배열

// 초기값 설정 (2) 무기 목록, 강화 단계, 소지금 초기화

// 무기 정보를 화면에 업데이트하는 함수

  // HTML 에 소지금, 판매가격, 강화가격, 보유 무기 개수 넘겨주어 화면에 표시

  // 검 이미지, 이름, 성공확률 표시할 요소 HTML 에서 가져오기
  
  // 무기 도감에 현재 무기가 없다면 추가

  // 무기 도감의 검 이미지 표시할 요소를 동적으로 추가

  // HTML 에 무기 이미지, 이름, 성공확률 넘겨주어 화면에 표시

// 초기 무기 정보를 표시할 요소들 불러오기

// "판매하기" 버튼 클릭시 호출되는 함수

  // 소지금에 판매가격 추가
  
  // 강화 단계 초기화

  // 변경된 정보 화면에 업데이트

// "강화하기" 버튼 클릭시 호출되는 함수

  // 소지금과 강화가격 비교
  
    // 랜덤 강화 확률 생성하고 성공 확률과 비교해 강화 성공 여부 결정

    // <강화성공>

      // 강화 상태 1 증가
      
      // 소지금에서 강화 비용만큼 감소

    // <강화실패>

      // 강화 상태 초기화

      // 강화 실패 알림창
  
  // 소지금 부족으로 강화 불가능

    // 소지금 부족 알림창

  // 변경된 정보 화면 업데아트

  // 현재 무기 개수와 강화 단계 비교

    // 현재 무기 추가

  // 화면에 보유 무기 개수 업데이트

// 불러온 요소들에 초기 정보 화면에 업데이트
